{
  "_name_or_path": "distilbert-base-uncased",
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "order_status",
    "1": "cancel_order",
    "2": "refund",
    "3": "subscription",
    "4": "technical_issue",
    "5": "payment_issue",
    "6": "greeting",
    "7": "goodbye",
    "8": "complaint",
    "9": "other"
  },
  "initializer_range": 0.02,
  "label2id": {
    "cancel_order": 1,
    "complaint": 8,
    "goodbye": 7,
    "greeting": 6,
    "order_status": 0,
    "other": 9,
    "payment_issue": 5,
    "refund": 2,
    "subscription": 3,
    "technical_issue": 4
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "torch_dtype": "float32",
  "transformers_version": "4.41.2",
  "vocab_size": 30522
}
